SoapAPI/src/test/resources/postMovieRental.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.soap.it.p.lodz.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:addSingleMovieRentalToStorage>
            <!--Optional:-->
            <arg0>
                <!--Optional:-->
                <movie>
                    <title>The Godfather</title>
                    <author>Francis Ford Coppola</author>
                    <rating>9.2</rating>
                    <rented>false</rented>
                    <!--Optional:-->
                    <id>testArg0</id>
                </movie>
                <!--Optional:-->
                <account>
                    <firstName>Jan2</firstName>
                    <lastName>Kowalski2</lastName>
                    <roleOfUser>USER</roleOfUser>
                    <isActive>true</isActive>
                    <id>testArg1</id>
                    <login>jan12</login>
                    <password>kowalski</password>
                </account>
                <!--Optional:-->
                <id>testArg2</id>
            </arg0>
        </api:addSingleMovieRentalToStorage>
    </soapenv:Body>
</soapenv:Envelope>